import { v4 as uuidv4 } from 'uuid';

export const slides = [
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2022/02/baner-21480h750.png',
        text: 'Glory to Ukraine!!!'
    },
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2021/08/1-1-1.jpg',
        text: '«LA П’ЄЦ» турбується про своїх клієнтів. Львів – велике і сучасне місто, тому ми стараємось цінувати Ваш час так само, як цінуєте його Ви. Наша доставка завжди з’являється біля ваших дверей вчасно. Якщо ні – замовник отримує промокод на безкоштовну піцу або рол до наступного замовлення **.\n' +
            '\n' +
            'Доставка їжі у Львові «LA П’ЄЦ» чітко розрахована за часом і зонами міста (зелена зона – доставка до 29 хв та жовта зона – до 59 хв). Ми одразу зазначаємо час доставки і робимо все, щоб не порушити його.\n' +
            '\n' +
            'Термін дії промокоду за спізнення – 30 днів. За одне замовлення можна використати лише один промокод за спізнення.\n' +
            '\n' +
            '** Промокод на безкоштовну піцу не видається при здійсненні доставки замовлення на конкретно вказаний клієнтом час.'
    },
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2021/08/4.png',
        text: 'Action “2+1”\n' +
            'Our special offer «2+1» is valid on Monday, Tuesday, Wednesday and Thursday inclusively. Order two pizzas and get one for free!\n' +
            '\n' +

            '* Pizza with the lowest price is considered to be free.\n' +

            '** This promotion is not compatible with other promotions. Only delivery and pickup orders.'
    },
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2021/08/dn.jpg',
        text: 'Святкуйте свій День народження з “LA П’ЄЦ” та отримуйте три піци або два роли у подарунок!\n' +
            '\n' +
            'Умови акції:\n' +
            '– Під подарунком мається на увазі безкоштовний “Святковий набір” з трьох піц: Капрічоза, Салямі та Маргарита або дво ролів: канада та філадельфія з лососем. Вміст набору є незмінним.\n' +
            '– Мінімальна сума замовлення має складати 700 грн, незалежно від зони доставки.\n' +
            '– Акцією може скористатися кожен клієнт в день свого народження та протягом 7-ми днів після нього.\n' +
            '– Дана акція не поєднується з іншими акціями.\n' +
            '– Під час отримання замовлення іменинник має показати кур’єру оригінал документу, що підтверджує його дату народження (паспорт, водійські права тощо)\n' +
            '\n' +
            '*Беручи участь у акції, кожен учасник тим самим підтверджує свою згоду на його фотографування та відео зйомку під час вручення замовлення та використання  отриманих матеріалів з маркетинговою метою, зокрема на безоплатне використання його імені, фотографії, інтерв’ю або інших матеріалів про нього для публікації в соціальних мережах (Instagram, Facebook, Telegram тощо), у ЗМІ, у будь-яких друкованих, аудіо- та відеоматеріалах, без будь-яких обмежень за територією, часом та способом використання, і таке використання жодним чином не відшкодовуватиметься Організатором/ Виконавцем акції, а саме “Доставкою піци на дровах “LA П’ЄЦ” . Надання такої згоди також розглядається у розумінні ст. 296, 307, 308 Цивільного Кодексу України.\n' +
            '\n' +
            'УВАГА! В період з 23 по 25 серпня включно акція до дня народження діє для всіх клієнтів з сумою замовлення 700 грн та більше. Святкуємо День Народження України разом!'
    },
    {
        image: 'https://la.ua/wp-content/uploads/2021/08/pryvedy-druga2.jpg',
        text: 'Отримайте 100 грн за… дружню пораду!\n' +
            '\n' +
            'Якщо ваш друг, зробить у нас замовлення завдяки вашим рекомендаціям, то ви обоє гарантовано отримаєте по 100 грн.\n' +
            '\n' +
            'Умови акції:\n' +
            '– Зареєструватися на нашому сайті та згенерувати унікальне реферальне посилання;\n' +
            '– Надіслати його будь-яким зручним способом своєму другу або декільком друзям;\n' +
            '– Якщо друг*, перейшовши по посиланню, зробить замовлення, то відразу отримає гарантовану знижку 100 грн;\n' +
            '– У своєму кабінеті ви побачите нараховані 100 бонусів, які можна використовувати для розрахунку за своє замовлення. Бонуси нараховуються протягом доби з моменту отримання другом замовлення.\n' +
            '– Мінімальна сума замовлення має складати 300 грн в Зеленій зоні та 400 грн в Жовтій;\n' +
            '– Дана акція не поєднується з іншими акціями;\n' +
            '– Можна запрошувати безліч друзів і збільшувати кількість бонусів))\n' +
            '\n' +
            '*Друг або новий друг – це той, хто ще жодного разу не робив у нас замовлення. Перевірка здійснюється по номеру телефону.'
    },
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2021/08/7-1.jpg',
        text: 'Забирайте своє замовлення самостійно та отримуйте суттєві переваги:\n' +
            '– гарячу, щойно спечену в печі улюблену піцу;\n' +
            '– знижку 15% ;\n' +
            '– відсутність мінімальної суми замовлення!*\n' +
            '*для використання Промо-сертифікату на безкоштовну піцу зберігається умова мінімальної суми замовлення 200 грн.\n' +
            '\n' +
            'Умови для отримання знижки 15%:\n' +
            '1. Обрати улюблені піцу, салат або напої в меню на сайті.\n' +
            '2. В “Корзині” обрати доставку “Самовивіз” та адресу найближчого до вас виробництва.\n' +
            '3. Знижка 15% нараховується автоматично та поширюється на усі позиції в чеку.\n' +
            '4. Підтвердити замовлення та очікувати на дзвінок адміністратора щодо уточнення часу забирання замовлення.\n' +
            '5. Також можна зателефонувати до оператора і просто озвучити бажання забрати замовлення самостійно.\n' +
            '6. Здійснити самовивіз та скористатися знижкою можна щодня з 10:00 до 22:00\n' +
            '7. Дана акція не поєднується з іншими акціями.'
    },
    {
        id: uuidv4(),
        image: 'https://la.ua/wp-content/uploads/2021/08/3.png',
        text: 'Твоя улюблена доставка відтепер завжди під рукою: наш мобільний додаток LA П’ЄЦ можна офіційно завантажити з App Store та Google Play!\n' +
            '\n' +
            'Більше того, при оформленні першого замовлення з мобільного додатку, ти отримуєш 100 грн у подарунок!\n' +
            '\n' +
            'Умови акції:\n' +
            '\n' +
            '– 100 грн надаються у вигляді знижки на перше замовлення з мобільного додатку LA П’ЄЦ при виконанні умови мінімальної суми для безкоштовної доставки.\n' +
            '– Мінімальна сума для безкоштовної доставки по цій акції складає 300 грн для Зеленої зони та 400 грн – Жовтої.\n' +
            '– Знижку нараховує оператор call-центру під час підтвердження замовлення в телефонній розмові.\n' +
            '– Якщо з урахуванням знижки 100 грн сума буде не достатньою для безкоштовної доставки, оператор запропонує щось дозамовити і потім нарахує знижку.\n' +
            '– Якщо замовлення буде вже оплаченим на сайті, оператор запропонує певний додаток до піци на суму 100 грн, який буде безкоштовним.\n' +
            '– Дана акція не поєднується з іншими акціями.\n' +
            '\n' +
            'Завантажуй мобільний додаток та насолоджуйся смаком улюбленої піци!'
    },
];
